In [23]:
import pandas as pd
df = pd.read_csv('http://bit.ly/kaggletrain',nrows=6)

In [24]:
cols = ['Fare','Embarked','Sex','Age']
X = df[cols]

In [25]:
X

      Fare Embarked     Sex   Age
0   7.2500        S    male  22.0
1  71.2833        C  female  38.0
2   7.9250        S  female  26.0
3  53.1000        S  female  35.0
4   8.0500        S    male  35.0
5   8.4583        Q    male   NaN

In [26]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.impute import SimpleImputer
from sklearn.compose import make_column_transformer

In [27]:
ohe = OneHotEncoder()
imp = SimpleImputer() #SimpleImputer는 결측치를 채워줌(NaN)

In [34]:
ct=make_column_transformer(
    (ohe, ['Embarked','Sex']), #문자열에는 원핫인코딩. s에 대문자 주의(소문자로 하니 transform 오류 발생)
    (imp, ['Age']), #0과 1이 아니지만 합칠 수 있다.
    remainder='passthrough') #Fare처럼 사용안한 column도 합 친다.

In [35]:
ct.fit_transform(X)
#결과로는 첫 3개의 column은 Embarked, 2열은 Sex, 1열은 Age, 1열은 Fare이다.
#처음 make_column_transformer 구성 순서대로 transform된다.

array([[ 0.    ,  0.    ,  1.    ,  0.    ,  1.    , 22.    ,  7.25  ],
       [ 1.    ,  0.    ,  0.    ,  1.    ,  0.    , 38.    , 71.2833],
       [ 0.    ,  0.    ,  1.    ,  1.    ,  0.    , 26.    ,  7.925 ],
       [ 0.    ,  0.    ,  1.    ,  1.    ,  0.    , 35.    , 53.1   ],
       [ 0.    ,  0.    ,  1.    ,  0.    ,  1.    , 35.    ,  8.05  ],
       [ 0.    ,  1.    ,  0.    ,  0.    ,  1.    , 31.2   ,  8.4583]])